---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures
source: html/eda15d4a-6b14-ee6b-0c44-6011077e6cfc.htm
---
# Autodesk.Revit.DB.BuiltInFailures

Provides a container of all Revit built-in FailureDefinitionId instances.

## Syntax (C#)
```csharp
public static class BuiltInFailures
```